# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть
n = 10
i = 1
rev = 0
aver = 0
while i<=n:
    print(f'положение {i}-й монеты')
    m = int(input())
    if m == 1:
        rev+=1
    else:
        aver+=1
    i+=1
if rev>=aver:
    print(f'нужно перевернуть {aver}')
else:
    print(f'нужно перевернуть {rev}')


# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. 
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
print('введите сумму чисел: ')
s = int(input())
print('введите произведение чисел: ')
p = int(input())
x = s/2 + ((s/2)**2-p)**0.5
y = s/2 - ((s/2)**2-p)**0.5
print(f'x = {round(x)}, y = {round(y)}')


# Требуется вывести все целые степени двойки (т.е. числа вида 2^k), не превосходящие числа N.
n = int(input('Введите число N:'))
i=2
while i <= n:
    print(i)
    i = i*2

